In [5]:
import numpy as np # calculation
import pandas as pd # Excel for Python
import datetime as dt # allow for date and time series manipulation
from datetime import timedelta
import seaborn as sns # a charting package
import matplotlib.pyplot as plt # the original Python chating package

#a `magic code` that allows ploting of charts within the notebook
%matplotlib inline

# Sets all rows to display
pd.options.display.max_rows = None

#Stops a false alarm chaining error
pd.options.mode.chained_assignment = None

import boto3
from io import BytesIO

client = boto3.client('s3',
                      aws_access_key_id = 'AKIATD4GPDJ44SNZZOO6',
                      aws_secret_access_key = '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') 

s3 = boto3.resource('s3',
                    aws_access_key_id = 'AKIATD4GPDJ44SNZZOO6',
                    aws_secret_access_key = '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')

my_bucket = s3.Bucket('flam-data-room')

files = list(my_bucket.objects.filter(Prefix='Master/'))

In [6]:
files

[s3.ObjectSummary(bucket_name='flam-data-room', key='Master/'),
 s3.ObjectSummary(bucket_name='flam-data-room', key='Master/Master_till Dec 2021.csv'),
 s3.ObjectSummary(bucket_name='flam-data-room', key='Master/master_01_2022.csv'),
 s3.ObjectSummary(bucket_name='flam-data-room', key='Master/master_02_2022.csv')]

In [13]:
li=[]
for key in files[1:]:
    print(key)
    obj = client.get_object(Bucket='flam-data-room', Key=key.key)
    df = pd.read_csv(BytesIO(obj['Body'].read()),header=0).astype('int64')
    li.append(df)

scans = pd.concat(li, axis=0, ignore_index=True).sort_values(by=['year','month','day']).drop_duplicates().reset_index(drop=True)

s3.ObjectSummary(bucket_name='flam-data-room', key='Athena/VTT/VTT_01_2022.csv')
s3.ObjectSummary(bucket_name='flam-data-room', key='Athena/VTT/VTT_02_2022.csv')
s3.ObjectSummary(bucket_name='flam-data-room', key='Athena/VTT/VTT_05_2021.csv')
s3.ObjectSummary(bucket_name='flam-data-room', key='Athena/VTT/VTT_06_2021.csv')
s3.ObjectSummary(bucket_name='flam-data-room', key='Athena/VTT/VTT_07_2021.csv')
s3.ObjectSummary(bucket_name='flam-data-room', key='Athena/VTT/VTT_08_2021.csv')
s3.ObjectSummary(bucket_name='flam-data-room', key='Athena/VTT/VTT_09_2021.csv')
s3.ObjectSummary(bucket_name='flam-data-room', key='Athena/VTT/VTT_10_2021.csv')
s3.ObjectSummary(bucket_name='flam-data-room', key='Athena/VTT/VTT_11_2021.csv')
s3.ObjectSummary(bucket_name='flam-data-room', key='Athena/VTT/VTT_12_2021.csv')

In [14]:
scans['date'] = scans.apply(lambda x: dt.date(x['year'], x['month'], x['day']), axis=1)
scans['date'] = scans['date'].astype('datetime64[ns]')

In [15]:
scans.tail()

         year  month  day  phone_number       date
1542835  2022      2    6    8898487889 2022-02-06
1542836  2022      2    6    9331730864 2022-02-06
1542837  2022      2    6    8144822437 2022-02-06
1542838  2022      2    6    8984321922 2022-02-06
1542839  2022      2    6    9656472213 2022-02-06

In [4]:
master['CohortDate'] = master.groupby('phone_number')['date'].transform('min')

In [5]:
master.tail()

         year  month  day  phone_number       date CohortDate
1899455  2022      2    6    9996316017 2022-02-06 2022-01-27
1899456  2022      2    6    9998209876 2022-02-06 2022-01-19
1899457  2022      2    6    9998500462 2022-02-06 2022-02-04
1899458  2022      2    6    9998523427 2022-02-06 2022-01-24
1899459  2022      2    6    9999666017 2022-02-06 2022-01-31

In [6]:
for i in range(31):
    master[str(i)] = np.where(master['date'] == master['CohortDate'] + timedelta(days=i) , 1, 0)

In [7]:
master.tail()

,year,month,day,phone_number,date,CohortDate,0,1,2,3,...,21,22,23,24,25,26,27,28,29,30
1899455,2022,2,6,9996316017,2022-02-06,2022-01-27,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1899456,2022,2,6,9998209876,2022-02-06,2022-01-19,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1899457,2022,2,6,9998500462,2022-02-06,2022-02-04,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
1899458,2022,2,6,9998523427,2022-02-06,2022-01-24,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1899459,2022,2,6,9999666017,2022-02-06,2022-01-31,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [8]:
# master['D3'] = np.where(master['date'] == master['CohortDate'] + timedelta(days=3) , 1, 0)
# master['D7'] = np.where(master['date'] == master['CohortDate'] + timedelta(days=7) , 1, 0)
# master['D30'] = np.where(master['date'] == master['CohortDate'] + timedelta(days=30) , 1, 0)
# master['D1'] = np.where(master['date'] == master['CohortDate'] + timedelta(days=1) , 1, 0)

In [9]:
# master[master['D1']==1]

In [11]:
#Group the data by columns CohortMonth','CohortIndex' then aggreate by column 'CustomerID'
cohort_data = master.groupby(
    ['CohortDate'])['0','1','2','3','4','5','6','7','8','9','10',
                   '11','12','13','14','15','16','17','18','19','20',
                   '21','22','23','24','25','26','27','28','29','30',].apply(pd.Series.sum).reset_index()

/var/folders/q3/nnqk34sx673b293mwy9x2zc80000gn/T/ipykernel_946/2688523611.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  cohort_data = master.groupby(

In [12]:
cohort_data.head()

,CohortDate,0,1,2,3,4,5,6,7,8,...,21,22,23,24,25,26,27,28,29,30
0,2021-05-01,305,2,2,2,7,4,1,1,0,...,4,1,0,1,0,0,1,8,22,5
1,2021-05-02,179,5,1,3,0,0,0,0,0,...,0,0,0,0,0,0,1,17,2,1
2,2021-05-03,251,7,1,2,3,0,1,0,0,...,0,0,0,0,0,5,12,0,0,0
3,2021-05-04,112,4,3,2,5,2,0,1,2,...,0,1,0,1,5,5,1,1,0,1
4,2021-05-05,284,13,11,3,3,1,4,1,1,...,2,1,1,20,22,2,1,3,1,1

In [13]:
print(cohort_data.columns)

Index(['CohortDate', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10',
       '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22',
       '23', '24', '25', '26', '27', '28', '29', '30'],
      dtype='object')

In [14]:
cohort_data_un = cohort_data.melt(id_vars = 'CohortDate', var_name = 'Retention', value_name = 'Users')

In [16]:
cohort_data_un.head()

  CohortDate Retention  Users
0 2021-05-01         0    305
1 2021-05-02         0    179
2 2021-05-03         0    251
3 2021-05-04         0    112
4 2021-05-05         0    284